In [50]:
import pandas as pd
data = pd.read_csv('tested.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [51]:
data.drop(['PassengerId','Name','SibSp','Ticket','Cabin','Embarked','Parch'],axis='columns',inplace=True)
data.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  34.5   7.8292
1         1       3  female  47.0   7.0000
2         0       2    male  62.0   9.6875
3         0       3    male  27.0   8.6625
4         1       3  female  22.0  12.2875

In [52]:
target = data.Survived
inputs = data.drop('Survived',axis='columns')

In [53]:
dummies = pd.get_dummies(inputs.Sex)
dummies.head(3)

   female  male
0       0     1
1       1     0
2       0     1

In [54]:
inputs = pd.concat([inputs,dummies],axis='columns')
inputs.head(3)

   Pclass     Sex   Age    Fare  female  male
0       3    male  34.5  7.8292       0     1
1       3  female  47.0  7.0000       1     0
2       2    male  62.0  9.6875       0     1

In [55]:
inputs.drop('Sex',axis='columns',inplace=True)
inputs.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [56]:
inputs.columns[inputs.isna().any()]

Index(['Age', 'Fare'], dtype='object')

In [57]:
inputs.Age[:11]

0     34.5
1     47.0
2     62.0
3     27.0
4     22.0
5     14.0
6     30.0
7     26.0
8     18.0
9     21.0
10     NaN
Name: Age, dtype: float64

In [58]:
inputs.Age = inputs.Age.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [59]:
inputs.Fare = inputs.Fare.fillna(inputs.Age.mean())
inputs.head()

   Pclass   Age     Fare  female  male
0       3  34.5   7.8292       0     1
1       3  47.0   7.0000       1     0
2       2  62.0   9.6875       0     1
3       3  27.0   8.6625       0     1
4       3  22.0  12.2875       1     0

In [60]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(inputs,target,test_size=0.2)

In [61]:
len(X_train)

334

In [62]:
len(X_test)

84

In [63]:
len(inputs)

418

In [64]:
X_train

     Pclass       Age      Fare  female  male
199       3  30.27259    8.1125       1     0
56        3  35.00000    7.8958       0     1
318       3  27.00000    7.8542       0     1
27        3  22.50000    7.2250       0     1
114       1  63.00000  221.7792       1     0
..      ...       ...       ...     ...   ...
155       3  24.00000    7.5500       0     1
71        3  21.00000    7.8958       0     1
358       3  30.27259    7.7500       0     1
315       3  17.00000    7.7333       1     0
88        3  30.27259    7.7500       1     0

[334 rows x 5 columns]

In [65]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [66]:
model.fit(X_train,y_train)

GaussianNB()

In [68]:
model.score(X_test,y_test)

1.0

In [69]:
X_test[:10]

     Pclass   Age      Fare  female  male
153       3  36.0   12.1833       1     0
399       3  31.0    7.7333       0     1
40        3  39.0   13.4167       0     1
175       2  15.0   39.0000       1     0
375       1  45.0  262.3750       1     0
296       2   1.0   41.5792       1     0
221       3  21.0    8.0500       0     1
241       2  45.0   30.0000       1     0
321       3  25.0    7.2292       0     1
389       3   6.0   21.0750       0     1

In [70]:
y_test[:10]

153    1
399    0
40     0
175    1
375    1
296    1
221    0
241    1
321    0
389    0
Name: Survived, dtype: int64

In [71]:
model.predict(X_test[:10])

array([1, 0, 0, 1, 1, 1, 0, 1, 0, 0], dtype=int64)

In [72]:
model.predict_proba(X_test[:10])

array([[0., 1.],
       [1., 0.],
       [1., 0.],
       [0., 1.],
       [0., 1.],
       [0., 1.],
       [1., 0.],
       [0., 1.],
       [1., 0.],
       [1., 0.]])